# 动态获取路径
import os


dir = os.path.dirname(__file__)  # 当前脚本目录
last1 = os.path.basename(dir)  # 最后一个目录
last2 = os.path.basename(os.path.dirname(dir))  # 倒数第二个目录
gategory = f"{last2}👾👾👾/{last1}"  # 动态获取的当前文件夹路径


# 0 定义一个类，一个节点就是一个类。comfyui会引入这个类作为一个节点==============================
class a1:
    def __init__(self):
        pass

    # 1 定义这个节点在ui界面中的位置=======================================================
    CATEGORY = gategory

    # ====================定义输入===========================================================
    @classmethod
    def INPUT_TYPES(s):  # 固定格式，输入参数种类
        # 返回一个包含所需输入类型的字典
        return {
            "required": {
                # 2 左边的输入点在这里定义=================================================
                "左边的输入": ("STRING", {"forceInput": True}),
                # 3 中间的参数栏在这里定义=================================================
                "参数：整数": (
                    "INT",
                    {
                        "default": 20,  # 默认
                        "min": 1,
                        "max": 10000,
                        "step": 2,  # 步长
                        "display": "number",
                    },
                ),  # 数值调整
            },
        }

    # 4 右边的输出点在这里定义=============================================================
    OUTPUT_NODE = True  # 表明它是一个输出节点
    # 输出的数据类型，需要大写
    RETURN_TYPES = ("INT",)
    # 自定义输出名称
    RETURN_NAMES = ("1整数",)

    # 5 节点的核心功能逻辑在这里定义========================================================
    FUNCTION = "test"  # 核心功能函数名称，将运行这个类中的这个方法

    def test(
        self,
    ):
        pass

    # 注释：实现了以上结构，就能在comfyui中引入这个节点，但这个节点现在是不能工作的
